import React from 'react';
<<<<<<< HEAD
<<<<<<< HEAD:react/toyproject/src/page/Home.jsx
import { BrowserRouter as Router, Route, Routes } from 'react-router-dom'; // Routes 추가
import Footer from './Footer';
import './css/Home.css';

function Home() {
  return (
    
    <div className='home-background'>
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 명준님 고쳐줘 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 명준님 고쳐줘 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      <Footer/>
    </div>
   
=======
=======
>>>>>>> main

function Home() {
  return (
    <div style={{ backgroundColor: 'black', height: '100vh', width:'100vh'}} className='home-background'>
      홈
    </div>
<<<<<<< HEAD
>>>>>>> main:react/react/toyproject/src/page/Home.jsx
=======
>>>>>>> main
  );
}

export default Home;