import React from 'react';
import { BrowserRouter as Router, Route, Routes } from 'react-router-dom'; // Routes 추가
import Footer from './Footer';

function Home() {
  return (
    
    <div className='home-background'>
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      v홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈
      홈 페이지 홈페이지 홈페이지 홈홈홈홈홈홈홈

      <Footer/>
    </div>
   
  );
}

export default Home;