import React from 'react';

function MusicDetail(){
    return(
        <div >
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
            나락도 락이다 나락도 락이다 나락도 락이다
        </div>
    );
}
export default MusicDetail;